Godzilla/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Copy motorbike surface from resources directory
cp $FOAM_RUN/CAD/motorBike.stl constant/geometry/
runApplication surfaceFeatures

runApplication blockMesh

runApplication decomposePar -copyZero
runParallel snappyHexMesh

runParallel patchSummary
runParallel potentialFoam
runParallel foamRun

runApplication reconstructPar

#------------------------------------------------------------------------------
